chronoweb/src/main/resources/webroot/example/getEventsXML/SimpleEventQuery_variable/EQGTGELTLE_quantity.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleEventQuery</queryName>
			<params>
				<param>
					<name>EQ_quantity_</name>
					<value xsi:type="xsd:double">20</value>
				</param>
				<param>
					<name>EQ_quantity_KGM</name>
					<value xsi:type="xsd:double">20</value>
				</param>
				<param>
					<name>GT_quantity_</name>
					<value xsi:type="xsd:double">20</value>
				</param>
				<param>
					<name>GE_quantity_</name>
					<value xsi:type="xsd:double">20</value>
				</param>
				<param>
					<name>LT_quantity_</name>
					<value xsi:type="xsd:double">20</value>
				</param>
				<param>
					<name>LE_quantity_</name>
					<value xsi:type="xsd:double">20</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>